In [7]:
import pandas as pd
import numpy as np

In [9]:
info = {
    "Name" : ["Harsh","Rahul","Shreya"],
    "CGPA" : ["9.5","8.3","8.8"]
}
df = pd.DataFrame(info)

In [10]:
print(df)

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [11]:
df

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [14]:
#series 1 dimensional labeled array
s= pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
print(type(s))
print(s[0])

<class 'pandas.Series'>
1

In [16]:
print(s[3])

4

In [35]:
s = pd.Series(["23","21","25","31"],index =["Adam","eva","finch","sachin"])
print(s)
s

Adam      23
eva       21
finch     25
sachin    31
dtype: str

Adam      23
eva       21
finch     25
sachin    31
dtype: str

In [23]:
print(s["Adam"])
print(s["sachin"])

23
31

In [25]:
print(s.index)

Index(['Adam', 'eva', 'finch', 'sachin'], dtype='str')

In [27]:
# property
# homogenous,vectorized operation
#handle missing value with Nan
#mutable value , immutable size

In [28]:
 # data Frames  - 2D labelled Array

In [31]:
info = {
    "Name" : ["Adam" , "eve"],
    "Age":[21,24],
    "CGPA":[9.8,9.4],


}

In [36]:
df = pd.DataFrame(info)
print(df,type(df))

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4 <class 'pandas.DataFrame'>

In [37]:
df

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4

In [38]:
print(df.index)

RangeIndex(start=0, stop=2, step=1)

In [39]:
print(df.columns)

Index(['Name', 'Age', 'CGPA'], dtype='str')

In [42]:
df = pd.DataFrame([["Harsh",21],["Virat",33],["Rohit",36]],columns=["Name","Age"])

In [43]:
print(df)

    Name  Age
0  Harsh   21
1  Virat   33
2  Rohit   36